# Задайте список из n чисел последовательности (1+1/n)^n и выведите на экран их сумму.

# *Пример:*

# Для n=6: [2.0, 2.25, 2.37037037037037, 2.44140625, 2.4883199999999994, 2.5216263717421135]



number = int(input('Введите число: '))
def f(x):
    return (1 + 1 / x) ** x

list = [f(i) for i in range(1, number + 1)]
print(list)
